7767517
358 428
Input                    in0                      0 1 in0
Convolution              conv_3                   1 1 in0 1 0=48 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1296
Swish                    silu_96                  1 1 1 2
Convolution              conv_4                   1 1 2 3 0=96 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=41472
Swish                    silu_97                  1 1 3 4
Convolution              conv_5                   1 1 4 5 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_98                  1 1 5 6
Slice                    split_0                  1 2 6 7 8 -23300=2,48,48 1=0
Split                    splitncnn_0              1 3 8 9 10 11
Convolution              conv_6                   1 1 11 12 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_99                  1 1 12 13
Convolution              conv_7                   1 1 13 14 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_100                 1 1 14 15
BinaryOp                 add_0                    2 1 10 15 16 0=0
Split                    splitncnn_1              1 3 16 17 18 19
Convolution              conv_8                   1 1 19 20 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_101                 1 1 20 21
Convolution              conv_9                   1 1 21 22 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_102                 1 1 22 23
BinaryOp                 add_1                    2 1 18 23 24 0=0
Concat                   cat_0                    4 1 7 9 17 24 25 0=0
Convolution              conv_10                  1 1 25 26 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
Swish                    silu_103                 1 1 26 27
Convolution              conv_11                  1 1 27 28 0=192 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=165888
Swish                    silu_104                 1 1 28 29
Convolution              conv_12                  1 1 29 30 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_105                 1 1 30 31
Slice                    split_1                  1 2 31 32 33 -23300=2,96,96 1=0
Split                    splitncnn_2              1 3 33 34 35 36
Convolution              conv_13                  1 1 36 37 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_106                 1 1 37 38
Convolution              conv_14                  1 1 38 39 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_107                 1 1 39 40
BinaryOp                 add_2                    2 1 35 40 41 0=0
Split                    splitncnn_3              1 3 41 42 43 44
Convolution              conv_15                  1 1 44 45 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_108                 1 1 45 46
Convolution              conv_16                  1 1 46 47 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_109                 1 1 47 48
BinaryOp                 add_3                    2 1 43 48 49 0=0
Split                    splitncnn_4              1 3 49 50 51 52
Convolution              conv_17                  1 1 52 53 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_110                 1 1 53 54
Convolution              conv_18                  1 1 54 55 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_111                 1 1 55 56
BinaryOp                 add_4                    2 1 51 56 57 0=0
Split                    splitncnn_5              1 3 57 58 59 60
Convolution              conv_19                  1 1 60 61 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_112                 1 1 61 62
Convolution              conv_20                  1 1 62 63 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_113                 1 1 63 64
BinaryOp                 add_5                    2 1 59 64 65 0=0
Concat                   cat_1                    6 1 32 34 42 50 58 65 66 0=0
Convolution              conv_21                  1 1 66 67 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=110592
Swish                    silu_114                 1 1 67 68
Split                    splitncnn_6              1 2 68 69 70
Convolution              conv_22                  1 1 70 71 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728
Swish                    silu_115                 1 1 71 72
ConvolutionDepthWise     convdw_226               1 1 72 73 0=384 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=3456 7=384
Convolution              conv_23                  1 1 73 74 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456
Swish                    silu_116                 1 1 74 75
Slice                    split_2                  1 2 75 76 77 -23300=2,192,192 1=0
Split                    splitncnn_7              1 3 77 78 79 80
Convolution              conv_24                  1 1 80 81 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_117                 1 1 81 82
Convolution              conv_25                  1 1 82 83 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_118                 1 1 83 84
BinaryOp                 add_6                    2 1 79 84 85 0=0
Split                    splitncnn_8              1 3 85 86 87 88
Convolution              conv_26                  1 1 88 89 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_119                 1 1 89 90
Convolution              conv_27                  1 1 90 91 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_120                 1 1 91 92
BinaryOp                 add_7                    2 1 87 92 93 0=0
Split                    splitncnn_9              1 3 93 94 95 96
Convolution              conv_28                  1 1 96 97 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_121                 1 1 97 98
Convolution              conv_29                  1 1 98 99 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_122                 1 1 99 100
BinaryOp                 add_8                    2 1 95 100 101 0=0
Split                    splitncnn_10             1 3 101 102 103 104
Convolution              conv_30                  1 1 104 105 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_123                 1 1 105 106
Convolution              conv_31                  1 1 106 107 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_124                 1 1 107 108
BinaryOp                 add_9                    2 1 103 108 109 0=0
Concat                   cat_2                    6 1 76 78 86 94 102 109 110 0=0
Convolution              conv_32                  1 1 110 111 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=442368
Swish                    silu_125                 1 1 111 112
Split                    splitncnn_11             1 2 112 113 114
Convolution              conv_33                  1 1 114 115 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=221184
Swish                    silu_126                 1 1 115 116
ConvolutionDepthWise     convdw_227               1 1 116 117 0=576 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=5184 7=576
Convolution              conv_34                  1 1 117 118 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=331776
Swish                    silu_127                 1 1 118 119
Slice                    split_3                  1 2 119 120 121 -23300=2,288,288 1=0
Split                    splitncnn_12             1 3 121 122 123 124
ConvolutionDepthWise     convdw_228               1 1 124 125 0=288 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2592 7=288
Swish                    silu_128                 1 1 125 126
Convolution              conv_35                  1 1 126 127 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=165888
Swish                    silu_129                 1 1 127 128
ConvolutionDepthWise     convdw_229               1 1 128 129 0=576 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 7=576
Swish                    silu_130                 1 1 129 130
Convolution              conv_36                  1 1 130 131 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=165888
Swish                    silu_131                 1 1 131 132
ConvolutionDepthWise     convdw_230               1 1 132 133 0=288 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2592 7=288
Swish                    silu_132                 1 1 133 134
BinaryOp                 add_10                   2 1 123 134 135 0=0
Split                    splitncnn_13             1 3 135 136 137 138
ConvolutionDepthWise     convdw_231               1 1 138 139 0=288 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2592 7=288
Swish                    silu_133                 1 1 139 140
Convolution              conv_37                  1 1 140 141 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=165888
Swish                    silu_134                 1 1 141 142
ConvolutionDepthWise     convdw_232               1 1 142 143 0=576 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 7=576
Swish                    silu_135                 1 1 143 144
Convolution              conv_38                  1 1 144 145 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=165888
Swish                    silu_136                 1 1 145 146
ConvolutionDepthWise     convdw_233               1 1 146 147 0=288 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2592 7=288
Swish                    silu_137                 1 1 147 148
BinaryOp                 add_11                   2 1 137 148 149 0=0
Concat                   cat_3                    4 1 120 122 136 149 150 0=0
Convolution              conv_39                  1 1 150 151 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=663552
Swish                    silu_138                 1 1 151 152
Convolution              conv_40                  1 1 152 153 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=165888
Swish                    silu_139                 1 1 153 154
Split                    splitncnn_14             1 2 154 155 156
Pooling                  maxpool2d_93             1 1 156 157 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_15             1 2 157 158 159
Pooling                  maxpool2d_94             1 1 159 160 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_16             1 2 160 161 162
Pooling                  maxpool2d_95             1 1 162 163 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_4                    4 1 155 158 161 163 164 0=0
Convolution              conv_41                  1 1 164 165 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=663552
Swish                    silu_140                 1 1 165 166
Convolution              conv_42                  1 1 166 167 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=331776
Swish                    silu_141                 1 1 167 168
Slice                    split_4                  1 2 168 169 170 -23300=2,288,288 1=0
Split                    splitncnn_17             1 2 170 171 172
Convolution              conv_43                  1 1 172 173 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=165888
Reshape                  view_208                 1 1 173 174 0=400 1=144 2=4
Slice                    split_5                  1 3 174 175 176 177 -23300=3,36,36,72 1=1
Split                    splitncnn_18             1 2 177 178 179
Permute                  transpose_219            1 1 175 180 0=1
MatMul                   matmul_217               2 1 180 176 181
BinaryOp                 mul_12                   1 1 181 182 0=2 1=1 2=1.666667e-01
Softmax                  softmax_1                1 1 182 183 0=2 1=1
MatMul                   matmultransb_0           2 1 179 183 184 0=1
Reshape                  view_209                 1 1 184 185 0=20 1=20 2=288
Reshape                  reshape_203              1 1 178 186 0=20 1=20 2=288
ConvolutionDepthWise     convdw_234               1 1 186 187 0=288 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2592 7=288
BinaryOp                 add_13                   2 1 185 187 188 0=0
Convolution              conv_44                  1 1 188 189 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=82944
BinaryOp                 add_14                   2 1 171 189 190 0=0
Split                    splitncnn_19             1 2 190 191 192
Convolution              conv_45                  1 1 192 193 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=165888
Swish                    silu_142                 1 1 193 194
Convolution              conv_46                  1 1 194 195 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=165888
BinaryOp                 add_15                   2 1 191 195 196 0=0
Concat                   cat_5                    2 1 169 196 197 0=0
Convolution              conv_47                  1 1 197 198 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=331776
Swish                    silu_143                 1 1 198 199
Split                    splitncnn_20             1 2 199 200 201
Interp                   upsample_200             1 1 201 202 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_6                    2 1 202 113 203 0=0
Convolution              conv_48                  1 1 203 204 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=368640
Swish                    silu_144                 1 1 204 205
Slice                    split_6                  1 2 205 206 207 -23300=2,192,192 1=0
Split                    splitncnn_21             1 2 207 208 209
Convolution              conv_49                  1 1 209 210 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_145                 1 1 210 211
Convolution              conv_50                  1 1 211 212 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_146                 1 1 212 213
Split                    splitncnn_22             1 2 213 214 215
Convolution              conv_51                  1 1 215 216 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_147                 1 1 216 217
Convolution              conv_52                  1 1 217 218 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_148                 1 1 218 219
Concat                   cat_7                    4 1 206 208 214 219 220 0=0
Convolution              conv_53                  1 1 220 221 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=294912
Swish                    silu_149                 1 1 221 222
Split                    splitncnn_23             1 2 222 223 224
Interp                   upsample_201             1 1 224 225 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_8                    2 1 225 69 226 0=0
Convolution              conv_54                  1 1 226 227 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=110592
Swish                    silu_150                 1 1 227 228
Slice                    split_7                  1 2 228 229 230 -23300=2,96,96 1=0
Split                    splitncnn_24             1 2 230 231 232
Convolution              conv_55                  1 1 232 233 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_151                 1 1 233 234
Convolution              conv_56                  1 1 234 235 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_152                 1 1 235 236
Split                    splitncnn_25             1 2 236 237 238
Convolution              conv_57                  1 1 238 239 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_153                 1 1 239 240
Convolution              conv_58                  1 1 240 241 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_154                 1 1 241 242
Concat                   cat_9                    4 1 229 231 237 242 243 0=0
Convolution              conv_59                  1 1 243 244 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728
Swish                    silu_155                 1 1 244 245
Split                    splitncnn_26             1 3 245 246 247 248
Convolution              conv_60                  1 1 247 249 0=192 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=331776
Swish                    silu_156                 1 1 249 250
Concat                   cat_10                   2 1 250 223 251 0=0
Convolution              conv_61                  1 1 251 252 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=221184
Swish                    silu_157                 1 1 252 253
Slice                    split_8                  1 2 253 254 255 -23300=2,192,192 1=0
Split                    splitncnn_27             1 3 255 256 257 258
ConvolutionDepthWise     convdw_235               1 1 258 259 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728 7=192
Swish                    silu_158                 1 1 259 260
Convolution              conv_62                  1 1 260 261 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728
Swish                    silu_159                 1 1 261 262
ConvolutionDepthWise     convdw_236               1 1 262 263 0=384 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3456 7=384
Swish                    silu_160                 1 1 263 264
Convolution              conv_63                  1 1 264 265 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728
Swish                    silu_161                 1 1 265 266
ConvolutionDepthWise     convdw_237               1 1 266 267 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728 7=192
Swish                    silu_162                 1 1 267 268
BinaryOp                 add_16                   2 1 257 268 269 0=0
Split                    splitncnn_28             1 3 269 270 271 272
ConvolutionDepthWise     convdw_238               1 1 272 273 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728 7=192
Swish                    silu_163                 1 1 273 274
Convolution              conv_64                  1 1 274 275 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728
Swish                    silu_164                 1 1 275 276
ConvolutionDepthWise     convdw_239               1 1 276 277 0=384 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3456 7=384
Swish                    silu_165                 1 1 277 278
Convolution              conv_65                  1 1 278 279 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728
Swish                    silu_166                 1 1 279 280
ConvolutionDepthWise     convdw_240               1 1 280 281 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728 7=192
Swish                    silu_167                 1 1 281 282
BinaryOp                 add_17                   2 1 271 282 283 0=0
Concat                   cat_11                   4 1 254 256 270 283 284 0=0
Convolution              conv_66                  1 1 284 285 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=294912
Swish                    silu_168                 1 1 285 286
Split                    splitncnn_29             1 3 286 287 288 289
Convolution              conv_67                  1 1 288 290 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456
Swish                    silu_169                 1 1 290 291
ConvolutionDepthWise     convdw_241               1 1 291 292 0=384 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=3456 7=384
Concat                   cat_12                   2 1 292 200 293 0=0
Convolution              conv_68                  1 1 293 294 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=552960
Swish                    silu_170                 1 1 294 295
Slice                    split_9                  1 2 295 296 297 -23300=2,288,288 1=0
Split                    splitncnn_30             1 3 297 298 299 300
ConvolutionDepthWise     convdw_242               1 1 300 301 0=288 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2592 7=288
Swish                    silu_171                 1 1 301 302
Convolution              conv_69                  1 1 302 303 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=165888
Swish                    silu_172                 1 1 303 304
ConvolutionDepthWise     convdw_243               1 1 304 305 0=576 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 7=576
Swish                    silu_173                 1 1 305 306
Convolution              conv_70                  1 1 306 307 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=165888
Swish                    silu_174                 1 1 307 308
ConvolutionDepthWise     convdw_244               1 1 308 309 0=288 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2592 7=288
Swish                    silu_175                 1 1 309 310
BinaryOp                 add_18                   2 1 299 310 311 0=0
Split                    splitncnn_31             1 3 311 312 313 314
ConvolutionDepthWise     convdw_245               1 1 314 315 0=288 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2592 7=288
Swish                    silu_176                 1 1 315 316
Convolution              conv_71                  1 1 316 317 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=165888
Swish                    silu_177                 1 1 317 318
ConvolutionDepthWise     convdw_246               1 1 318 319 0=576 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 7=576
Swish                    silu_178                 1 1 319 320
Convolution              conv_72                  1 1 320 321 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=165888
Swish                    silu_179                 1 1 321 322
ConvolutionDepthWise     convdw_247               1 1 322 323 0=288 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2592 7=288
Swish                    silu_180                 1 1 323 324
BinaryOp                 add_19                   2 1 313 324 325 0=0
Concat                   cat_13                   4 1 296 298 312 325 326 0=0
Convolution              conv_73                  1 1 326 327 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=663552
Swish                    silu_181                 1 1 327 328
Split                    splitncnn_32             1 2 328 329 330
MemoryData               pnnx_196                 0 1 331 0=8400
Convolution              conv_74                  1 1 246 332 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=110592
Swish                    silu_182                 1 1 332 333
Convolution              conv_75                  1 1 333 334 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_183                 1 1 334 335
Convolution              conv_76                  1 1 335 336 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_248               1 1 248 337 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728 7=192
Swish                    silu_184                 1 1 337 338
Convolution              conv_77                  1 1 338 339 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_185                 1 1 339 340
ConvolutionDepthWise     convdw_249               1 1 340 341 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728 7=192
Swish                    silu_186                 1 1 341 342
Convolution              conv_78                  1 1 342 343 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_187                 1 1 343 344
Convolution              conv_79                  1 1 344 345 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=15360
Concat                   cat_14                   2 1 336 345 346 0=0
Convolution              conv_80                  1 1 287 347 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=221184
Swish                    silu_188                 1 1 347 348
Convolution              conv_81                  1 1 348 349 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_189                 1 1 349 350
Convolution              conv_82                  1 1 350 351 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_250               1 1 289 352 0=384 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3456 7=384
Swish                    silu_190                 1 1 352 353
Convolution              conv_83                  1 1 353 354 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728
Swish                    silu_191                 1 1 354 355
ConvolutionDepthWise     convdw_251               1 1 355 356 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728 7=192
Swish                    silu_192                 1 1 356 357
Convolution              conv_84                  1 1 357 358 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_193                 1 1 358 359
Convolution              conv_85                  1 1 359 360 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=15360
Concat                   cat_15                   2 1 351 360 361 0=0
Convolution              conv_86                  1 1 329 362 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_194                 1 1 362 363
Convolution              conv_87                  1 1 363 364 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_195                 1 1 364 365
Convolution              conv_88                  1 1 365 366 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_252               1 1 330 367 0=576 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184 7=576
Swish                    silu_196                 1 1 367 368
Convolution              conv_89                  1 1 368 369 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=110592
Swish                    silu_197                 1 1 369 370
ConvolutionDepthWise     convdw_253               1 1 370 371 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728 7=192
Swish                    silu_198                 1 1 371 372
Convolution              conv_90                  1 1 372 373 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_199                 1 1 373 374
Convolution              conv_91                  1 1 374 375 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=15360
Concat                   cat_16                   2 1 366 375 376 0=0
Reshape                  view_210                 1 1 346 377 0=6400 1=144
Reshape                  view_211                 1 1 361 378 0=1600 1=144
Reshape                  view_212                 1 1 376 379 0=400 1=144
Concat                   cat_17                   3 1 377 378 379 380 0=1
Slice                    split_10                 1 2 380 381 382 -23300=2,64,80 1=0
Reshape                  view_213                 1 1 381 383 0=8400 1=16 2=4
Permute                  transpose_221            1 1 383 384 0=2
Softmax                  softmax_2                1 1 384 385 0=0 1=1
Convolution              conv_92                  1 1 385 386 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=16
Reshape                  view_214                 1 1 386 387 0=8400 1=4
MemoryData               pnnx_fold_anchor_points.1 0 1 388 0=8400 1=2
MemoryData               pnnx_fold_anchor_points.1_1 0 1 389 0=8400 1=2
Slice                    split_11                 1 2 387 390 391 -23300=2,2,2 1=0
BinaryOp                 sub_20                   2 1 388 390 392 0=1
BinaryOp                 add_21                   2 1 389 391 393 0=0
Concat                   cat_18                   2 1 392 393 394 0=0
Reshape                  reshape_204              1 1 331 395 0=8400 1=1
BinaryOp                 mul_22                   2 1 394 395 396 0=2
Sigmoid                  sigmoid_0                1 1 382 397
Concat                   cat_19                   2 1 396 397 398 0=0
Permute                  permute_202              1 1 398 399 0=1
Slice                    split_12                 1 2 399 400 401 -23300=2,4,80 1=1
Split                    splitncnn_33             1 2 401 402 403
Reduction                amax_215                 1 1 403 404 0=4 1=0 -23303=1,-1 4=0 5=1
torch.topk               torch.topk_57            1 2 404 405 406
ExpandDims               unsqueeze_222            1 1 406 407 -23303=1,-1
Split                    splitncnn_34             1 2 407 408 409
Tile                     repeat_205               1 1 409 410 -23302=2,1,4
torch.gather             torch.gather_39          2 1 400 410 411
Tile                     repeat_206               1 1 408 412 -23302=2,1,80
torch.gather             torch.gather_40          2 1 402 412 413
Flatten                  flatten_216              1 1 413 414
torch.topk               torch.topk_58            1 2 414 415 416
Split                    splitncnn_35             1 2 416 417 418
BinaryOp                 remainder_23             1 1 417 419 0=-1 1=1 2=8.000000e+01
BinaryOp                 floor_divide_24          1 1 418 420 0=-1 1=1 2=8.000000e+01
ExpandDims               unsqueeze_223            1 1 420 421 -23303=1,-1
Tile                     repeat_207               1 1 421 422 -23302=2,1,4
torch.gather             torch.gather_41          2 1 411 422 423
ExpandDims               unsqueeze_224            1 1 415 424 -23303=1,-1
ExpandDims               unsqueeze_225            1 1 419 425 -23303=1,-1
Tensor.to                Tensor.to_8              1 1 425 426
Concat                   cat_20                   3 1 423 424 426 out0 0=1
